"""
Задача 8. Создайте класс КЛИЕНТ с методами,
позволяющими вывести на экран информацию о клиентах банка,
а также определить соответствие клиента критерию поиска.

Создайте дочерние классы ВКЛАДЧИК (фамилия, дата открытия вклада, размер вклада, процент по вкладу),
КРЕДИТОР (фамилия, дата выдачи кредита, размер кредита, процент по кредиту, остаток долга),
ОРГАНИЗАЦИЯ (название, дата открытия счета, номер счета, сумма на счету)

со своими методами вывода информации на экран и определения соответствия дате 
(открытия вклада, выдаче кредита, открытия счета).

Создайте список из п клиентов, выведите полную информацию из базы на экран,
а также организуйте поиск клиентов, начавших сотрудничать с банком в заданную дату.
"""