"""
Задача 10. Создайте класс ТРАНСПОРТ с методами,
позволяющими вывести на экран информацию о транспортном средстве, а также определить,
находится ли транспортное средство в пределах заданных координат.

Создайте дочерние классы САМОЛЕТ (марка, максимальные скорость и высота, количество пассажиров, координаты),
АВТОМОБИЛЬ (марка, номер, год выпуска, координаты),
КОРАБЛЬ (название, координаты, скорость, количество пассажиров, порт приписки)
со своими методами вывода информации на экран и определения присутствия
транспортного средства в пределах заданных координат.

Создайте список из п транспортных средств, выведите полную информацию из базы на экран,
а также организуйте поиск транспортных средств, которые сейчас находятся в пределах заданных координат.
"""