"""
Задача  6. Создайте класс ТОВАР с методами, позволяющими вывести на экран
информацию о товаре, а также определить, предназначен ли он для заданного возраста потребителя.

Создайте дочерние классы ИГРУШКА (название, цена, производитель, материал, возраст, на который рассчитана),
КНИГА (название, автор, цена, издательство, возраст, на который рассчитана),
СПОРТИНВЕНТАРЬ (название, цена, производитель, возраст, на который рассчитан)
со своими методами вывода информации на экран и определения соответствия возрасту потребителя.

Создайте список из п товаров, выведите полную информацию из базы на экран,
а также организуйте поиск товаров для потребителя в заданном возрастном диапазоне.
"""