"""
Задача 4. Создайте класс ТРАНСПОРТ с методами, позволяющими вывести на экран информацию о 
транспортном средстве, а также определить грузоподъемность транспортного средства.

Создайте дочерние классы АВТОМОБИЛЬ (марка, номер, скорость, грузоподъемность),
МОТОЦИКЛ (марка, номер, скорость, грузоподъемность, наличие коляски,
при этом если коляска отсутствует, то грузоподъемность равна нулю),

ГРУЗОВИК (марка, номер, скорость, грузоподъемность, наличие прицепа,
при этом если есть прицеп, то грузоподъемность увеличивается в два раза)
со своими методами вывода информации на экран и определения грузоподъемности.

Создайте список из п машин, выведите полную информацию на экран, а также организуйте поиск машин, удовлетворяющих требованиям грузоподъемности.
"""
