"""
Задача  11. Создайте класс ИГРУШКА с методами, позволяющими вывести на экран информацию о товаре,
а также определить соответствие игрушки критерию поиска.

Создайте дочерние классы КУБИК (цвет, цена, материал, размер ребра),
МЯЧ (цена, цвет, диаметр, материал),
МАШИНКА (название, цена, производитель, цвет) со своими методами вывода информации на экран и 
определения соответствия заданному цвету.

Создайте список из п игрушек, выведите полную информацию из базы на экран,
а также организуйте поиск игрушек заданного цвета.
"""