"""
Задача 5. Создайте класс ТОВАР с методами, позволяющими вывести на экран информацию о товаре,
а также определить, может ли приобрести товар покупатель, имеющий заданную сумму денег.

Создайте дочерние классы ПРОДУКТ (название, цена, дата производства, срок годности),
ПАРТИЯ (название, цена за штуку, количество штук, дата производства, срок годности),
ТЕЛЕФОН (название, цена) со своими методами вывода информации на экран и определения соответствия з
аданной цене.

Создайте список из п товаров, выведите полную информацию из базы на экран,
а также организуйте поиск товара, который может приобрести покупатель, имеющий заданную сумму денег.
"""