"""
Задача 2. Создайте класс ИЗДАНИЕ с методом, позволяющим вывести на экран информацию об издании,
а также определить, является ли данное издание искомым.

Создайте дочерние классы КНИГА (название, фамилия автора, год издания, издательство),
СТАТЬЯ (название, фамилия автора, название журнала, его номер и год издания),
ЭЛЕКТРОННЫЙ РЕСУРС (название, фамилия автора, ссылка, аннотация) со своими методами вывода информации 
на экран.

Создайте список из п изданий, выведите полную информацию из списка,
а также организуйте поиск изданий по фамилии автора. 
"""