"""
Задача 7. Создайте класс ТЕЛЕФОННЫЙ СПРАВОЧНИК с методами,
позволяющими вывести на экран информацию о записях в телефонном справочнике,
а также определить соответствие записи критерию поиска.

Создайте дочерние классы ПЕРСОНА (фамилия, адрес, номер телефона),
ОРГАНИЗАЦИЯ (название, адрес, телефон, факс, контактное лицо),
ДРУГ (фамилия, адрес, номер телефона, дата рождения)
со своими методами вывода информации на экран и определения соответствия заданной фамилии.

Создайте список из п записей, выведите полную информацию из базы на экран,
 а также организуйте поиск в базе по фамилии.
"""