"""
Задача  9. Создайте класс ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ с методами, 
позволяющими вывести на экран информацию о программном обеспечении,
а также определить соответствие возможности использования (на текущую дату).

Создайте дочерние классы СВОБОДНОЕ (название, производитель),
УСЛОВНО БЕСПЛАТНОЕ (название, производитель, дата установки, срок бесплатного использования),
КОММЕРЧЕСКОЕ (название, производитель, цена, дата установки, срок использования) 
со своими методами вывода информации на экран и определения возможности использования на текущую дату.

Создайте список из п видов программного обеспечения, выведите полную информацию из базы на экран,
а также организуйте поиск программного обеспечения, которое допустимо использовать на текущую дату.
"""