"""
Выполнить программную реализацию и сравнительный анализ быстродействия поиска элементов с помощью бинарного дерева в заданном массиве элементов:81 77 79 68 10 12 13 20 15 24 27 42 33 51 57.
Для этого:
1. Реализовать представление данных с помощью бинарного дерева;
2. Реализовать поиск элементов в массиве с учетом времени на поиск
3. Реализовать поиск элемента в бинарном дереве с учетом времени на
поиск
4. Реализовать поиск элементов в отсортированном массиве с учетом
времени на поиск
5. Провести сравнительный анализ представления данных в трех
программных реализациях.

"""