/*
Создать 3 класса(базовый и 2 предка) которые описывают некоторых работников с почасовой оплатой (один из предков)
и фиксированной оплатой (второй предок).

Описать в базовом классе абстрактный метод для расчета среднемесячной зарплаты.

Для «почасовщиков» формула для расчета такая: «среднемесячная зарплата = 20.8*8*ставка в час»,
для работников с фиксированной оплатой «среднемесячная зарплата = фиксированной месячной оплате».

    a)Упорядочить всю последовательность рабочих по убыванию среднемесячной зарплаты.
    При совпадении зарплаты – упорядочить данные в алфавитном порядке по имени. Вывести идентификатор работника,
    имя и среднемесячную зарплату для всех элементов списка.
    b)Вывести первые 5 имен работников из полученного выше списка (задача А).
    c)Вывести последние 3 идентификаторы работников из полученного више списка (задача А).
    d)Организовать запись и чтение коллекции в/из файл(а)
    e)Организовать обработку некорректного формата входного файла

 */
package com.demka;

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
