Многочлен n-й степени с целыми коэффициентми представлен списком
своих коэффициентов, начиная со старшего члена. 
Например,  x^3+3x-2  представлен списком [1,0,3,-2]
Разработать консольные программы для следующих задач.
1. Найти сумму двух многочленов одной степени.
2. Найти сумму двух многочленов различных степеней.
3. Умножить многочлен на заданное число.
4. Вычислить значение многочлена для заданного x по схеме Горнера.
5. Найти значение коэффициента при x^n в произведении многочлена n-й
   степени на другой многочлен (возможно другой степени). 
6. Вычислить скалярное произведение двух векторов. 
7. Вычислить произведение двух многочленов.
8. Построить многочлен с целыми коэффициентами с заданными корнями.
9. Найти все делители (положительные и отрицательные) целого числа.
10. Найти все целочисленные корни многочлена с целыми коэффициентами.
11. Найти производную многочлена.
12. Получить значения многочлена на отрезке [0..n] в целых точках.
13. Разделить многочлен на (x-k), если k - корень многочлена