"""
В качестве заданий используются задания по работе со списками из прошлого семестра,
требуется выполнить их программную реализацию с применением массивов. Выполните расчет
времени исполнения и количества памяти при списочной реализации и при реализации с
помощью массивов (на основе лекции). В отчете предложите обоснованный подход к
программной реализациии с учетом предлагаемой Вами структуре данных. Для заданий 12,13,
14, 15, 16 выполниет обоснование используемой структуры данных, проведите сравнительный
анализ двух програмных реализаций.

Задача 1. В массиве, содержащем положительные и отрицательные целые числа, вычислить
сумму четных положительных элементов.
"""