class Task1(object):
    """
    Создать словарь адресной книги, содержащий ФИО и адрес. Заполнить его 50 элементами, реализовать поиск по адресу
    """
    pass

class Task2(object):
    """
    создать словарь телефонного справочника. Заполнить его 50 элементами. Реализовать поиск по телефону
    """
    pass

class Task3(object):
    """
    реализовать проверку на существующие записи в предыдущих заданиях с возможностью дополнения
    """
    pass

class Task4(object):
    """
    создать словарь на свободную тему, включающий в себя кортеж в качестве ключа, реализовать поиск
    """
    pass

class Task5(object):
    """
    создать словарь авиарейсов, в возможностью поиска маршрута из точки А в точку В с учётом 1 пересадки
    """
    pass

class Task6(object):
    """
    создать словарь железнодорожных сообщений с учетом более одной но менее 4 пересадок, с рекомендацией оптимального маршрута по времени
    """
    pass