"
Используя скрипты, написать программы, в которых требуется
• получить вводом с клавиатуры два числа
• первое число возвести в степень второго, вывести эти числа
и результат
• затем второе число возвести в степень первого, вывести
результат
• разделить первое число на второе, вывести результат
• выполнить деление на ноль, посмотреть на результат

Указание. Для ввода строки с клавиатуры использовать функцию readline().
Для преобразования строки в число использовать функции as.integer(), as.double().
Для формирования строки с результатами использовать функции paste(), paste0().
Для вывода результатов функцию print().
"
TODO
