"""
Задача 3
Реализовать текстовый калькулятор для решения тригонометрических уравнения. Добавить
возможность сохранения хода решения в файл. Встроенными функциями и библиотечными для решения уравнений и систем пользоваться ЗАПРЕЩЕНО.
"""

class ExpressionProcessing():
    def __init__(self):
        pass

    def processing(self):
        pass

    def save_results(self):
        pass

    def out_results(self):
        pass

print("")