"""
Модуль для генерации рандомных данных для вызова классов
"""
from random import choice

def plane_type():
    """Получаем тип самолета"""
    d = ["истребитель", "штурмовик", "бомбардировщик", "гражданский транспортный", "гражданский пассажирский"]
    return choice(d)

def get_country():
    d = ["Россия", "США", "Китай", "Япония", "Индонезия", "Канада", "Великобритания", "Греция", "Германия", "Сингапур", "Австралия", "Франция","Бельгия", "Польша", "Украина", "Беларусь"]
    return choice(d)
